[
  {
    "receivedTimestamp": "2025-11-20T03:00:04.514Z",
    "receivedTime": 1763607604510,
    "latencyMs": 4510,
    "latencySeconds": 4.51,
    "data": {
      "catalogId": 157,
      "catalogName": "Maintenance Updates",
      "publishDate": 1763607600000,
      "title": "Binance Will Support the THORChain (RUNE) Network Upgrade - 2025-11-20",
      "body": "This is a general announcement. Products and services referred to here may not be available in your region.\nFellow Binancians,\nStarting at approximately 2025-11-20 17:00 (UTC), Binance will suspend the deposits and withdrawals of token(s) on the THORChain (RUNE) network to support its network upgrade to ensure the best user experience.\nThe network upgrade will take place at the block height of 23,761,879, or approximately at 2025-11-20 18:00 (UTC).\nPlease note:\nThe trading of token(s) on the aforementioned network will not be impacted.Binance will handle all technical requirements involved for all users.Deposits and withdrawals for token(s) on the aforementioned network will be reopened once the upgraded network is deemed to be stable. No further announcement will be posted.There may be discrepancies between this original content in English and any translated versions. Please refer to the original English version for the most accurate information, in case any discrepancies arise.\nFor more information, please refer to the announcement from the project team.\nThank you for your support!\nBinance Team\n2025-11-20",
      "disclaimer": "Trade on-the-go with Binance’s crypto trading app (iOS/Android)Find us on TelegramWhatsAppXFacebookInstagramDiscordBinance reserves the right in its sole discretion to amend or cancel this announcement at any time and for any reasons without prior notice.Disclaimer: Digital asset prices are subject to high market risk and price volatility. The value of your investment may go down or up, and you may not get back the amount invested. You are solely responsible for your investment decisions and Binance is not liable for any losses you may incur. Past performance is not a reliable predictor of future performance. You should only invest in products you are familiar with and where you understand the risks. You should carefully consider your investment experience, financial situation, investment objectives and risk tolerance and consult an independent financial adviser prior to making any investment. This material should not be construed as financial advice. For more information, see our Terms of Use and Risk Warning.Content is partially generated by and or through Binance AI, and may include third party information. This content is purely for information purposes on an “as is” and “as available” basis without any warranty or confirmations. For more information, see our AI Terms."
    }
  },
  {
    "receivedTimestamp": "2025-11-20T06:00:02.995Z",
    "receivedTime": 1763618402992,
    "latencyMs": 1625,
    "latencySeconds": 1.625,
    "data": {
      "catalogId": 93,
      "catalogName": "Latest Activities",
      "publishDate": 1763618401367,
      "title": "BABY Locked Products: Enjoy Up to 29.9% APR in Rewards!",
      "body": "This is a general announcement. Products and services referred to here may not be available in your region. Terms and conditions apply. \nFellow Binancians,\nBinance Simple Earn is pleased to announce a Locked Products update on Babylon (BABY). Complete subscriptions to BABY on Simple Earn Locked Products during the Promotion Period to get up to 29.9% in APR rewards!\nPromotion: Enjoy Up to 29.9% APR in Rewards on BABY Locked Products\nPromotion Period: Subscriptions must take place between 2025-11-20 10:00 (UTC) and 2026-03-20 23:59 (UTC) to be counted as eligible. Existing BABY locked positions will also be eligible. Subscription Format: First-come, first-served basis. Minimum subscription amount, maximum subscription limits, and duration requirements apply, and will impact your APR. Refer to the table below and the terms in this announcement for more details.Reward Calculation Period: From 00:00 (UTC) on the day after an eligible subscription to Locked Products is completed, until the end of the subscription period.Rewards Distribution: On a daily basis.\nOffered Products (Locked Products)\nDigital AssetDurationAPR During the Promotion PeriodMin. Subscription Limit per UserMax. Subscription Limit per UserBABY30 days20%1 BABY10,000,000 BABY60 days24%1 BABY5,000,000 BABY120 days29.9%1 BABY2,000,000 BABY\nHow to Get Started with BABY Locked Products\nBuy BABY on the spot market, or via the Buy Crypto page, which supports payment methods including Visa and Mastercard cards, Apple Pay, Google Pay, and account balances. Users can also deposit BABY to their Binance account. Head to [Earn], and search for BABY.Select Duration, and subscribe with BABY to start earning up to 29.9% APR daily!\nSubscribe Now!\nTerms & Conditions:\nThese terms and conditions (“Activity Terms”) govern users’ participation in the activity above (“Activity”). By participating in this Activity, users agree to these Activity Terms, and the following additional terms: (a) Binance Terms and Conditions for Prize Promotions; (b) Binance Terms of Use; and (c) Binance Privacy Notice; all of which are incorporated by reference into these terms and conditions. In the case of any inconsistency or conflict between these Activity Terms, and any other incorporated terms, the provisions of these Activity Terms shall prevail, followed by the  following in this order of precedence, and to the extent of such conflict: (a) Binance Terms and Conditions for Prize Promotions; (b) Binance Terms of Use; and (c) Binance Privacy Notice.Only users who complete identity verification during the Promotion Period can qualify for rewards in the Promotion. The products or features referred to above may not be available in your region. Users are responsible for informing themselves about and observing any restrictions and/or requirements imposed with respect to the access to and use of Binance services in each country from which the services are accessed.Binance reserves the right to adjust APRs at any time after the Promotion Period without prior notice. Please refer to Binance Simple Earn Terms & Conditions prior to using any products on the Binance Simple Earn platform.Users may view their Locked Products subscriptions by going to Wallets > Earn > Simple Earn > Locked.Users may enable the “Auto-Subscribe” function before completing subscriptions to Locked Products, which will automatically renew users’ existing Locked Products position into a new position of the same duration upon expiry.Unlock period for Locked Products: One Day.Please see the Locked Products FAQ for more information.About early redemption for Simple Earn Locked Products: Users may redeem their assets in advance. After choosing early redemption, digital assets will be returned to the spot account, and users will not be entitled to any rewards (accrued or otherwise). Any distributed rewards will be deducted from the refunded principal. It may take 48-72 hours to receive the digital assets back into the Spot Account.Sponsored rewards are contributions made by the respective protocol team to Binance with the express purpose of facilitating promotional activities.Binance reserves the right at any time in its sole and absolute discretion to determine and/or amend or vary these terms and conditions without prior notice, including but not limited to canceling, extending, terminating, or suspending these activities, the eligibility terms and criteria, the selection and number of winners, and the timing of any act to be done, and all Participants shall be bound by these amendments.Binance reserves the right to disqualify a user’s reward eligibility if the account is involved in any dishonest behavior (e.g., wash trading, illegally bulk account registrations/logins, self dealing, or market manipulation). Binance further reserves the right to disqualify any participants who tamper with Binance program code, or interfere with the operation of Binance program code with other software.There may be discrepancies in the translated version of this original article in English. Please reference this original version for the latest or most accurate information where any discrepancies may arise.\nThank you for your support!\nBinance Team\n2025-11-20",
      "disclaimer": "Trade on-the-go with Binance’s crypto trading app (iOS/Android)Find us on TelegramWhatsAppXFacebookInstagramDiscordBinance reserves the right in its sole discretion to amend or cancel this announcement at any time and for any reasons without prior notice.Disclaimer: Digital asset prices can be volatile. The value of your investment may go down or up and you may not get back the amount invested. You are solely responsible for your investment decisions and Binance is not liable for any losses you may incur. Binance will return digital assets to users’ spot account after the agreed period ends or upon early redemption. Binance does not guarantee that you will receive any specific reward, or any return over time. Not financial advice. For more information, see our Terms of Use and Risk Warning."
    }
  }
]